; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-5nodes-1000size-3degree-100mindistance-4trucks-2packages-321seed

(define (problem transport-city-sequential-5nodes-1000size-3degree-100mindistance-4trucks-2packages-321seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 434,788 -> 251,956
  (road city-loc-3 city-loc-1)
  (= (road-length city-loc-3 city-loc-1) 25)
  ; 251,956 -> 434,788
  (road city-loc-1 city-loc-3)
  (= (road-length city-loc-1 city-loc-3) 25)
  ; 434,788 -> 617,465
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 38)
  ; 617,465 -> 434,788
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 38)
  ; 891,680 -> 617,465
  (road city-loc-4 city-loc-2)
  (= (road-length city-loc-4 city-loc-2) 35)
  ; 617,465 -> 891,680
  (road city-loc-2 city-loc-4)
  (= (road-length city-loc-2 city-loc-4) 35)
  ; 891,680 -> 434,788
  (road city-loc-4 city-loc-3)
  (= (road-length city-loc-4 city-loc-3) 47)
  ; 434,788 -> 891,680
  (road city-loc-3 city-loc-4)
  (= (road-length city-loc-3 city-loc-4) 47)
  ; 432,464 -> 251,956
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 53)
  ; 251,956 -> 432,464
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 53)
  ; 432,464 -> 617,465
  (road city-loc-5 city-loc-2)
  (= (road-length city-loc-5 city-loc-2) 19)
  ; 617,465 -> 432,464
  (road city-loc-2 city-loc-5)
  (= (road-length city-loc-2 city-loc-5) 19)
  ; 432,464 -> 434,788
  (road city-loc-5 city-loc-3)
  (= (road-length city-loc-5 city-loc-3) 33)
  ; 434,788 -> 432,464
  (road city-loc-3 city-loc-5)
  (= (road-length city-loc-3 city-loc-5) 33)
  ; 432,464 -> 891,680
  (road city-loc-5 city-loc-4)
  (= (road-length city-loc-5 city-loc-4) 51)
  ; 891,680 -> 432,464
  (road city-loc-4 city-loc-5)
  (= (road-length city-loc-4 city-loc-5) 51)
  (at package-1 city-loc-2)
  (at package-2 city-loc-1)
  (at truck-1 city-loc-3)
  (capacity truck-1 capacity-4)
  (at truck-2 city-loc-1)
  (capacity truck-2 capacity-3)
  (at truck-3 city-loc-5)
  (capacity truck-3 capacity-3)
  (at truck-4 city-loc-2)
  (capacity truck-4 capacity-3)
 )
 (:goal (and
  (at package-1 city-loc-1)
  (at package-2 city-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-4 city-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-loc-2) (capacity truck-4 capacity-3)
   added: (in package-1 truck-4) (capacity truck-4 capacity-2)
   goals met: 0 of 2
2. (pick-up truck-2 city-loc-1 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-loc-1) (capacity truck-2 capacity-3)
   added: (in package-2 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 2
3. (drive truck-4 city-loc-2 city-loc-3)
   deleted: (at truck-4 city-loc-2)
   added: (at truck-4 city-loc-3)
   goals met: 0 of 2
4. (drive truck-4 city-loc-3 city-loc-1)
   deleted: (at truck-4 city-loc-3)
   added: (at truck-4 city-loc-1)
   goals met: 0 of 2
5. (drive truck-2 city-loc-1 city-loc-3)
   deleted: (at truck-2 city-loc-1)
   added: (at truck-2 city-loc-3)
   goals met: 0 of 2
6. (drive truck-2 city-loc-3 city-loc-2)
   deleted: (at truck-2 city-loc-3)
   added: (at truck-2 city-loc-2)
   goals met: 0 of 2
7. (drop truck-2 city-loc-2 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-2)
   added: (at package-2 city-loc-2) (capacity truck-2 capacity-3)
   goals met: 1 of 2
8. (drop truck-4 city-loc-1 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-4) (capacity truck-4 capacity-2)
   added: (at package-1 city-loc-1) (capacity truck-4 capacity-3)
   goals met: 2 of 2
